mydata/posts/about-me/2012-01-23-coding-religion.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>---</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="---"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-05-20 15:00:21 EDT"/>
<meta name="author" content="Neil Smithline"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">---</h1>


title:             "My Coding Religion"
description:       "whatever"
date:              "2012-01-23 Mon 23:40:34"
layout:            post
comments:          true
author:            Neil Smithline
published:         false
---


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Technical Religious Beliefs</h2>
<div class="outline-text-2" id="text-1">

<p>Individuals, teams, companies, and even cross-company development projects such as a 3<sup>rd</sup>-party implementing a plug-in should be produced in the most efficient, reusable, and maintainable manner. This includes:
</p><ul>
<li>Reusing or adding parameters to code rather than copying-and-pasting.
</li>
<li>Applications should strictly enforce boundaries based on layering, packages, objects, etc&hellip;
</li>
<li>The use of appropriate tools, interaction models, programming languages, documentation practices, and other technical choices.
</li>
<li>Most importantly, business requirements should be made with full knowledge of the technical cost and take precedence over technical best-practices.
</li>
</ul>

</div>
</div>
</div>

</body>
</html>
